[
    {
        "title": "Will Apple Reclaim Its Title as the Largest Company in the World by Market Cap? The Answer May Surprise You.",
        "summary": "Apple was the largest company by market cap for more than a decade but recently was dethroned by Microsoft and Nvidia.  The company is growing sales much slower than Nvidia or Microsoft.  Apple's slow growth and risks to its earnings mean it will likely not regain its market cap leadership position.",
        "pubDate": "2025-06-01T09:40:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/motleyfool.com/fa7313957e0300e14bc6ecbd4ca1e37b",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/apple-reclaim-title-largest-company-094000087.html"
    },
    {
        "title": "Taser Boss Tops Ranking of Highest-Paid CEOs, With $165 Million. Here’s the List.",
        "summary": "A stock award propelled Rick Smith past Apple’s Tim Cook and Blackstone’s Schwarzman to the top of WSJ’s annual ranking.",
        "pubDate": "2025-06-01T09:30:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/wsj.com/29d38e2381d83a41f58f2fefdb17644d",
        "clickThroughUrl_url": null
    },
    {
        "title": "Best Stock to Buy Right Now: Apple vs. Chipotle",
        "summary": "Chipotle has had more consistent annual growth rates than Apple.  Meanwhile, Apple is currently right in the crosshairs of more tariffs.  The clearer path for future growth at Chipotle makes it more appealing.",
        "pubDate": "2025-05-31T14:00:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/motleyfool.com/df0eb1d905ae00645da5e2b32236e440",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/best-stock-buy-now-apple-140000064.html"
    },
    {
        "title": "Where the Stock Market Stands Now After a Wild Start to the Year",
        "summary": "(Bloomberg) -- The stock market’s crazy first five months of 2025 have left Wall Street pros in a bit of a pickle. Most Read from BloombergBillionaire Steve Cohen Wants NY to Expand Taxpayer-Backed FerryNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing AlbaniaWhere the Wild Children’s Museums AreThe Economic Benefits of Paying Workers to MoveNYC Congestion Toll Brings In $216 Million in First Four MonthsComing off the best month for the S&P 500 Index in a year and a half and the b",
        "pubDate": "2025-05-31T12:00:07Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/bloomberg_holding_pen_162/316e8a5fca7a77a45b937e9087f48ec5",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/where-stock-market-stands-now-120007297.html"
    },
    {
        "title": "47% of Berkshire Hathaway's $276 Billion Warren Buffett-Led Portfolio Is Invested in 3 Dividend Stocks",
        "summary": "Apple has developed an ecosystem of tech devices that its customers love and are willing to trade up to have.  American Express has numerous earnings streams, and a younger cohort of cardholders is driving growth.  Coca-Cola's business has proven resilient under pressure, and it reliably boosts its dividends.",
        "pubDate": "2025-05-31T11:30:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/motleyfool.com/6089273cec29288f92390c597609a3f3",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/47-berkshire-hathaways-276-billion-113000522.html"
    },
    {
        "title": "These Are Stocks You Should Watch in June",
        "summary": "Stocks soared in May, boosted by easing trade tensions, solid corporate earnings and signs of economic resilience. Trade and tax policy are likely to remain Wall Street's focus in June.",
        "pubDate": "2025-05-31T11:00:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/investopedia_245/2f842fd25797214fbbd6fbdd36b11317",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/stocks-watch-june-110000643.html"
    },
    {
        "title": "Shimmers, floating toolbars, and radical transparency: Here’s what iOS 26 could look like",
        "summary": "Apple needs something eye-catching right now. A new user interface, likely called ‘solarium,’ is about to turn heads.",
        "pubDate": "2025-05-31T09:00:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/fastcompany_735/2d115dc4185f4e8023451c094b97da50",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/shimmers-floating-toolbars-radical-transparency-090000778.html"
    },
    {
        "title": "Warren Buffett Holds Apple Stock Despite Tariffs and Buys a Restaurant Stock Up 4,500% in 15 Years",
        "summary": "Warren Buffett's Berkshire Hathaway continued to hold Apple and added to its stake in Domino’s Pizza in the first quarter.  Apple stock looks expensive with earnings increasing just 8% in the second quarter, and tariffs could slow profit growth even further.  Warren Buffett manages the vast majority of Berkshire Hathaway's stock portfolio, and the company made interesting capital allocation decisions concerning Apple (NASDAQ: AAPL) and Domino's Pizza (NASDAQ: DPZ) in the first quarter.",
        "pubDate": "2025-05-31T08:40:00Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/motleyfool.com/7cc2f9e51760a7a467d535cd27a51c1b",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/warren-buffett-holds-apple-stock-084000253.html"
    },
    {
        "title": "Trump’s trade war is bruising Apple — and your 401(k)",
        "summary": "President Donald Trump’s swipes at Apple aren’t just bruising the company’s bottom line — they may also be taking a bite out of your 401(k).",
        "pubDate": "2025-05-31T08:00:04Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/cnn_business_articles_218/1bc30278dfd82a8f00844af2620bb042",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/trump-trade-war-bruising-apple-080004236.html"
    },
    {
        "title": "Judge Weighs Big Changes to Google, Including Breakup, AI Limits",
        "summary": "(Bloomberg) -- The federal judge who will decide how to limit Google’s monopoly in search is considering its advantage in artificial intelligence, and aiming to minimize harm to the other players in the market with any resolution. Most Read from BloombergBillionaire Steve Cohen Wants NY to Expand Taxpayer-Backed FerryNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing AlbaniaNYC Congestion Toll Brings In $216 Million in First Four MonthsThe Economic Benefits of Paying Workers to Mov",
        "pubDate": "2025-05-30T21:35:17Z",
        "thumbnail_originalUrl": "https://media.zenfs.com/en/bloomberg_holding_pen_162/60a381c70bce3a3dc1275e90f402eba1",
        "clickThroughUrl_url": "https://finance.yahoo.com/news/google-search-judge-zeroes-ai-175909734.html"
    }
]